/*
 * IIM_42652.h
 *
 *  Created on: Feb 1, 2025
 *      Author: oleksii
 */

#ifndef INC_IIM_42652_H_
#define INC_IIM_42652_H_
#include <Ixm42xxxDefs.h>

/*
Гіроскоп: fsr = 2000 dps
Акселерометр: fsr = 4 g
Роздільна здатність часових міток: 16 мкС
Увімкнення механізму FIFO з наступною конфігурацією:
Режим запису FIFO, тобто одиниця підрахунку FIFO є пакетом
Режим знімка FIFO, тобто скидання даних при переповненні FIFO
Часова мітка записується в FIFO
Формат Little Endian для fifo_count і fifo_data
Генерація переривання за порогом FIFO, коли кількість пакетів досягає порогу FIFO
Встановлення порогу FIFO на 1 пакет
Увімкнення даних температури та часових міток для запису в FIFO
*/

uint8_t int_iim_42652(){




};




















#endif /* INC_IIM_42652_H_ */
