/*
 * LIS3MD.h
 *
Список регістрів LIS3MDL

1. OFFSET_X_REG_L_M (05h) Нижній байт жорсткого зсуву по осі X (двійковий код, 16-бітний).
2. OFFSET_X_REG_H_M (06h) Старший байт жорсткого зсуву по осі X.
3. OFFSET_Y_REG_L_M (07h) Нижній байт жорсткого зсуву по осі Y.
4. OFFSET_Y_REG_H_M (08h) Старший байт жорсткого зсуву по осі Y.
5. OFFSET_Z_REG_L_M (09h) Нижній байт жорсткого зсуву по осі Z.
6. OFFSET_Z_REG_H_M (0Ah) Старший байт жорсткого зсуву по осі Z.

7. WHO_AM_I (0Fh) 		  Ідентифікаційний код пристрою (значення за замовчуванням: 0x3D).

8. CTRL_REG1 (20h)

	[0] TEMP_EN (0: вимкнено, 1: вмикається датчик температури).
	[1:2] OM[1:0] (режими роботи для осей X та Y).
	[3:5] DO[2:0] (частота оновлення даних).
	[6]   FAST_ODR (0: вимкнено, 1: увімкнено).
	[7]   ST (0: вимкнено, 1: увімкнено самоперевірку).

9. CTRL_REG2 (21h)
	[0-1] FS[1:0] (вибір діапазону вимірювань: 00: ±4 гаусс, 01: ±8 гаусс, 10: ±12 гаусс, 11: ±16 гаусс).
	[2] REBOOT (0: нормальний режим, 1: перезавантаження).
	[3] SOFT_RST (0: нормальна робота, 1: скидання конфігурацій).


10. CTRL_REG3 (22h)
	[0]   LP (0: нормальний режим, 1: режим низького споживання).
	[1]   SIM (0: 4-провідний SPI, 1: 3-провідний SPI).
	[2:3] MD[1:0] (режим роботи: 00: безперервний, 01: одноразовий, 10/11: режим вимкнення).

11. CTRL_REG4 (23h)
	Біт 0-1: OMZ[1:0] (режими роботи для осі Z).
	Біт 2: BLE (0: малий кінець, 1: великий кінець).

12. CTRL_REG5 (24h)
	Біт 0: FAST_READ (0: вимкнено, 1: увімкнено).
	Біт 1: BDU (0: постійне оновлення, 1: блокувати оновлення до зчитування).

13. STATUS_REG (27h)
	Біт 0: ZYXOR (переповнення даних по всіх осях).
	Біт 1: ZOR (переповнення даних по осі Z).
	Біт 2: YOR (переповнення даних по осі Y).
	Біт 3: XOR (переповнення даних по осі X).
	Біт 4: ZYXDA (нові дані по всіх осях доступні).
	Біт 5: ZDA (нові дані по осі Z доступні).
	Біт 6: YDA (нові дані по осі Y доступні).
	Біт 7: XDA (нові дані по осі X доступні).

14. OUT_X_L (28h) Нижній байт даних по осі X (двійковий код).
15. OUT_X_H (29h) Старший байт даних по осі X.
16. OUT_Y_L (2Ah) Нижній байт даних по осі Y.
17. OUT_Y_H (2Bh) Старший байт даних по осі Y.
18. OUT_Z_L (2Ch) Нижній байт даних по осі Z.
19. OUT_Z_H (2Dh) Старший байт даних по осі Z.

20. TEMP_OUT_L (2Eh)  Нижній байт даних з температурного датчика.
21. TEMP_OUT_H (2Fh) Старший байт даних з температурного датчика.

22. INT_CFG (30h)
	Біт 0: XIEN (увімкнення переривання по осі X).
	Біт 1: YIEN (увімкнення переривання по осі Y).
	Біт 2: ZIEN (увімкнення переривання по осі Z).
	Біт 3: IEA (активна конфігурація переривання).
	Біт 4: LIR (запам'ятовування запиту на переривання).
	Біт 5: IEN (увімкнення переривання).

23. INT_SRC (31h)
	Біт 0: PTH_X (перевищення порога по позитивній стороні по осі X).
	Біт 1: PTH_Y (перевищення порога по позитивній стороні по осі Y).
	Біт 2: PTH_Z (перевищення порога по позитивній стороні по осі Z).
	Біт 3: NTH_X (перевищення порога по негативній стороні по осі X).
	Біт 4: NTH_Y (перевищення порога по негативній стороні по осі Y).
	Біт 5: NTH_Z (перевищення порога по негативній стороні по осі Z).
	Біт 6: MROI (переповнення внутрішнього діапазону вимірювання).
	Біт 7: INT (сигналізація події переривання).

24. INT_THS_L (32h) Нижній байт порога переривання (значення в 16-бітному беззнаковому форматі).
25. INT_THS_H (33h) Старший байт порога переривання.

 */

#ifndef INC_LIS3MD_H_
#define INC_LIS3MD_H_



#endif /* INC_LIS3MD_H_ */
